tsung/passive_returning_user.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='30000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="wywb-withoutpagination.mui3yzewey.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="6" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="12" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="30" unit="second">
      <users arrivalrate="14" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="30" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="30" unit="second">
      <users arrivalrate="18" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="30" unit="second">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="11" duration="30" unit="second">
      <users arrivalrate="22" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="12" duration="30" unit="second">
      <users arrivalrate="24" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <setdynvars sourcetype="random_number" start="1" end="10000">
        <var name="num"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="400" end="899">
        <var name="userrand"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="15" end="40">
        <var name="thinktimerand"/>
      </setdynvars>

        <!-- Log in with new email -->
        <transaction name="user_login">
          <request subst="true">
            <dyn_variable name="userid" re="Location: .*/users/([0-9]+)"></dyn_variable>
            <http url="/login" method="POST" version="1.1" contents="session[email]=example-%%_userrand%%@railstutorial.org&amp;
             session[password]=password&amp;" content_type="application/x-www-form-urlencoded" />
          </request>
        </transaction>

      <!-- Check the users he is following -->
      <transaction name="user_following">
        <request subst="true">
          <http url="/users/%%_userid%%/following/" method="GET" version="1.1" />
        </request>
      </transaction>

      <!-- Go to the users page -->
      <transaction name="users_page">
        <request subst="true">
          <http url="/users" method="GET" version="1.1" />
        </request>
      </transaction>


      <!-- Go the the user he wants to follow -->
      <transaction name="Random_user_follow">
        <request subst="true">
          <http url="/users/%%_userrand%%" method="GET" version="1.1" />
        </request>
      <!-- Follow the user -->
        <request subst="true">
          <http url="/relationships" method="POST" version="1.1" contents="followed_id=%%_userrand%%&amp;commit=Follow"/>
        </request>
      </transaction>
      <!-- Go to his following page again -->
      <transaction name="user_following_again">
        <request subst="true">
          <http url='/users/%%_userid%%/following/' version='1.1' method='GET'></http>
        </request>
      </transaction>

      <thinktime value="%%_thinktimerand%%" random="false"/>
        <!-- Log out -->
      <transaction name="log_out">
        <request subst="true">
          <http url="/logout" method="DELETE" version="1.1" content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>

    </session>
  </sessions>
</tsung>