tsung/passive_returning_user.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='30000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="withpagination.mui3yzewey.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <setdynvars sourcetype="random_number" start="1" end="10000">
        <var name="num"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="99">
        <var name="userrand"/>
      </setdynvars>

        <!-- Log in with new email -->

      <request subst="true">
        <dyn_variable name="userid" re="Location: .*/users/([0-9]+)"></dyn_variable>
        <http url="/login" method="POST" version="1.1" contents="session[email]=example-%%_userrand%%@railstutorial.org&amp;
         session[password]=password&amp;" content_type="application/x-www-form-urlencoded" />
      </request>

        <request subst="true">
          <http url="/users/%%_userrand%%" method="GET" version="1.1" />
        </request>

        <!-- Check event page, follow 2 Users, refresh events page -->
        <request>
          <http url='/events' version='1.1' method='GET'></http>
        </request>

        <request subst="true">
          <http url="/users" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/users/60" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/relationships" method="POST" version="1.1" contents="followed_id=81&amp;commit=Follow"/>
        </request>

        <request subst="true">
          <http url="/users" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/users/70" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/relationships" method="POST" version="1.1" contents="followed_id=91&amp;commit=Follow"/>
        </request>

        <request>
          <http url='/events' version='1.1' method='GET'></http>
        </request>

        <!-- Log out -->

      <request subst="true">
        <http url="/logout" method="DELETE" version="1.1" content_type="application/x-www-form-urlencoded" />
      </request>

    </session>
  </sessions>
</tsung>